/* */
             PGM
/*           5 min delay */
             DCL        VAR(&DELAY) TYPE(*DEC) LEN(5) VALUE(300)

 START:
             CALL       PGM(THOMASP/HB_PINGA)
             CALL       PGM(THOMASP/HB_PINGS)
             CALL       PGM(THOMASP/HB_PINGW)

             GOTO       CMDLBL(DELAY)

 DELAY:
             DLYJOB     DLY(&DELAY)

             GOTO       CMDLBL(START)

             ENDPGM  
